import Typography from '@mui/joy/Typography';
import React from 'react';
import {HomeButton} from 'components/HomeButton/HomeButton.tsx'

export function IntroRoute() {
  return (
    <>
    
    <div style = {{display: 'flex'}}>
        <HomeButton/>
        <Typography level="h2">З чаго ўсе пачалося</Typography>
    </div>
    
    <Typography sx={{padding: '0.125em'}}>
        Мяне заўсёды цікавіла гэта тэма, але ўсе рукі не даходзілі. А тут мяне  папрасілі дапамогі з інфармацыяй для школьнага заданьня, а потым і самому захацелася больш даведацца пра імёны прадзедаў. <br/>
Аказалася, што нават ў адкрытым доступе можна знайсьці многа звестак.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Так уцягнуўся — дакумэнты, архівы, і вось што атрымалася.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
З чаго пачаць...
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Старыя дакумэнты ў сям’і — з гэтым усё кепска, усё страчана ці спалена :) Пара фотаздымкаў і адна неапазнаная.
    </Typography>
    
    <Typography sx={{padding: '0.125em'}}>
Расспыты сярод сваякоў — самая каштоўная, хоць і хутка забываючая крыніца :
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Размова з маці дала пару імёнаў і прозвішчаў, але памяць і дакумэнты часам не супадаюць.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Анлайн-базы даных — сайты накшталт FamilySearch, Geneteka, «Памяць народа», Усеагульнае генэалагічнае дрэва, архівы, тэматычная чаты ў соцсетках — усё гэта дапамагае адшукаць сьляды продкаў, асабліва калі яны служылі.<br/>
Рэвізскія сказкі і метрычныя кнігі.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Рэві́зскія ска́зкі — дакумэнты, якія адлюстроўваюць вынікі правядзеньня падушных перапісей («рэвізій») падатнага насельніцтва Расейскай імпэрыі ў пачатку XVIII — другой палове XIX стагоддзяў, праводзімых з мэтай падаткаабкладаньня «рэвізскіх душ» (то бок усіх, акрамя дваран і вайскоўцаў).
Гэта старыя сьпісы і запісы, дзе ўказвалі сем’і паіменна — з узростам, сваяцтвам і месцам жыхарства. Усё здавалася проста, але са складанасьцямі. Узрост часта не супадае: сяляне маглі не памятаць дакладнага года ці карысна яго сказіць, перапісчыкі маглі акругліць або арыентавацца па знешнім выглядзе, асабліва памыляючыся з пажылымі людзьмі. Сказкі такія часам казкі.
Імёны таксама запісвалі па-рознаму з нагоды і выпадку, асабліва пры пераходзе з польскай лацінкі на рускую кірыліцу.
Прозвішчы на рускай запісаны з указаньнем на прыналежнасьць, чый / чыя / чые — Вайтовічэў, Гаўронаўна, Беевы.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Галоўнае — ня баіцца першых дзіўнасьцяў, далей становіцца толькі цікавей.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Паехалі…
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
24 кастрычніка 1795 году Расея, Прусія і Аўстрыя ўзаемна ўзгаднілі дагавор аб канчатковым Трэцім падзеле Рэчы Паспалітай абодвух народаў , па якім тэрыторыя Лідзкага павету перайшла да Расейскай імпэрыі. У кастрычніку 1795 года на тэрыторыі павету  правялі інвэнтарызацыю маёнткаў і належных ім фальваркаў з указаньнем дымоў (dymów) і тых, хто ў іх жыве, душ мужчынскага і жаночага полу. Слова «дым» у дадзеным кантэксьце азначала асобную сялянскую гаспадаркау, то бок дом, часцей за ўсё пад кіраўніцтвам аднаго галавы сям’і.
У перапісах і падатковых сьпісах «дымы» служылі адзінкай уліку для падаткаабкладаньня.
Адзін «дым» мог уключаць некалькі пакаленьняў адной сям’і. Часам некалькі «душ» у адным «дыме» мелі розныя прозвішчы — яны маглі быць сваякамі або жыхарамі аднаго гаспадарства.
    </Typography>
    <Typography sx={{padding: '0.125em'}}>
Цяпер мы будзем ведаць сваіх, што нарадзіліся не только за польскім часам, а нават за “ліцьвінскім” часам,  у ВКЛ. 
    </Typography>
    </>
  );
};
